init.org
#+TITLE: Настройки Emacs, основанные на Org-mode
#+LANGUAGE: ru
#+PROPERTY: header-args :results silent
#+PROPERTY: header-args :tangle yes
#+auto_tangle: t

В данном файле представлены настройки Emacs, подгружаемые при помощи =Org-babel=. Все блоки кода при загрузке Emacs автоматически извлекаются и исполняются.

Это моя вторая попытка оформления настроек для Emacs при помощи =Org-mode=. Первая попытка вылилась в абсолютно нечитаемый файл, выглядящий как `тарелка спагетти`.

* Содержание :toc:github:
- [[#важно][Важно!]]
- [[#файл-раннего-запуска][Файл раннего запуска]]
- [[#константы][Константы]]
- [[#пакетный-менеджер][Пакетный менеджер]]
- [[#настройки-setupel][Настройки setup.el]]
- [[#общие-настройки][Общие настройки]]
  - [[#сохранение-истории-команд-и-позиций][Сохранение истории команд и позиций]]
  - [[#ускорение-запуска-emacs][Ускорение запуска Emacs]]
  - [[#убираем-мусор][Убираем мусор]]
  - [[#работа-с-файлами][Работа с файлами]]
- [[#настройки-пользовательского-интерфейса][Настройки пользовательского интерфейса]]
  - [[#украшательства][Украшательства]]
  - [[#вкладки][Вкладки]]
  - [[#статусная-строка][Статусная строка]]
  - [[#стартовый-экран][Стартовый экран]]
  - [[#отображение-строк][Отображение строк]]
  - [[#отображение-окон][Отображение окон]]
  - [[#дерево-каталогов-проекта][Дерево каталогов проекта]]
- [[#настройки-справки][Настройки справки]]
- [[#настройки-ввода][Настройки ввода]]
  - [[#мышь][Мышь]]
  - [[#клавиатура][Клавиатура]]
- [[#зло-и-коварство-evil-mode][Зло и коварство: Evil mode]]
- [[#настройки-редактирования][Настройки редактирования]]
  - [[#настройки-сохранения][Настройки сохранения]]
  - [[#настройки-отступов][Настройки отступов]]
  - [[#настройки-отмены-и-повтора][Настройки отмены и повтора]]
  - [[#настройки-отражения-скобок][Настройки отражения скобок]]
  - [[#настройки-комментирования][Настройки комментирования]]
  - [[#настройки-замены][Настройки замены]]
  - [[#полезные-команды][Полезные команды]]
- [[#настройки-автодополнения][Настройки автодополнения]]
  - [[#вспомогательные-функции][Вспомогательные функции]]
  - [[#lsp][LSP]]
  - [[#corfu-или-company][Corfu или Company]]
  - [[#vertico-consult-и-embark-или-ivy][Vertico, Consult и Embark или Ivy]]
  - [[#сниппеты][Сниппеты]]
- [[#настройки-для-языков-программирования][Настройки для языков программирования]]
  - [[#markdown][Markdown]]
  - [[#org-mode][Org-mode]]
  - [[#ess][ESS]]
  - [[#python][Python]]
  - [[#js][JS]]
  - [[#lua][Lua]]
  - [[#latex][LaTeX]]

* Важно!

Для нормальной работы нативной компиляции _нужна_ библиотека =libgccjit=. В Windows проще установить библиотеку через MSYS2:

#+begin_src shell :tangle no
pacman -S mingw-w64-i686-libgccjit
#+end_src

* Файл раннего запуска

Данный файл загружается *до* основной инициализации Emacs.

#+begin_src emacs-lisp :tangle early-init.el
;; early-init.el --- Emacs config -*- lexical-binding: t; no-byte-compile: t; -*-
#+end_src

#+begin_src emacs-lisp
;; init.el --- Emacs config -*- lexical-binding: t; no-byte-compile: t; -*-
#+end_src

Расширяем горизонты возможного... Увеличиваем порог срабатывания сборщика мусора для ускорения запуска Emacs.

#+begin_src emacs-lisp :tangle early-init.el
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
#+end_src

Также для ускорения запуска советуют очищать =file-name-handler-alist= --- список регулярных выражений, предназначенных для определения и специальной обработки некоторых типов файлов.

#+begin_src emacs-lisp :tangle early-init.el
(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)
(add-hook 'emacs-startup-hook (lambda ()
                                  (setq gc-cons-threshold (* 8 1024 1024))
                                  (setq file-name-handler-alist file-name-handler-alist-original)
                                  (makunbound 'file-name-handler-alist-original)))
#+end_src

Переопределение некоторых стандартных папок.

#+begin_src emacs-lisp :tangle early-init.el
(setq user-emacs-directory
      (expand-file-name "emacs/" (or (getenv "XDG_CACHE_HOME") "~/.cache/")))

(setq native-comp-eln-load-path
      `(,(expand-file-name "eln-cache/" (or (getenv "XDG_CACHE_HOME") "~/.cache/"))))

(push (expand-file-name "modules/" (file-name-directory user-init-file))
      load-path)

(setq custom-file
      (expand-file-name "custom.el" user-emacs-directory))
#+end_src

Отключение не нужных элементов интерфейса. Чем раньше это сделать --- тем лучше, не будет тратиься время на их загрузку.

#+begin_src emacs-lisp :tangle early-init.el
(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)

(setq visible-bell t
      ring-bell-function 'ignore
      inhibit-splash-screen t
      inhibit-startup-message t
      use-dialog-box nil)
#+end_src

Отключение встроенного менеджера пакетов =package.el=.

#+begin_src emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil
      package-quickstart nil)

(setq native-comp-speed -1)
(setq straight-check-for-modifications '(check-on-save find-when-checking))
#+end_src

* Константы

Организуем вспомогательные константы, показывающие факт запуска Emacs в Windows или в 64-битной системе. Они нужны будут в дальнейшем для условной установки пакетов.

#+begin_src emacs-lisp
(defconst init/lsp-mode t
    "Use LSP-mode or Eglot otherwise.")

(defconst init/corfu nil
    "Use corfu for buffer completion.")

(defconst init/vertico nil
    "Use vertico for minibuffer completion.")

(defconst init/evil nil
    "To be evil or not.")

(defconst ensure/isWindows
    (memq system-type '(cygwin windows-nt ms-dos))
    "Equals t if Emacs works on Windows host system.")
#+end_src

* Пакетный менеджер

При помощи данного кода загружается и активируется пакетный менеджер [[https://github.com/radian-software/straight.el][straight.el]].

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
        (with-current-buffer
                (url-retrieve-synchronously
                 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
                 'silent 'inhibit-cookies)
            (goto-char (point-max))
            (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

* Настройки setup.el

Установка =setup.el= для дальнейшей настройки Emacs. Данный пакет функционально в целом аналогичен =use-package=, но он гораздо меньше, и гораздо проще настраивается и расширяется. =setup= -- это макрос, который разворачивается в итоговый исполняемый код. Более подробную информацию можно найти тут [[https://www.emacswiki.org/emacs/SetupEl][EmacsWiki - setup.el]] и тут [[https://git.sr.ht/~pkal/setup][setup.el repo]].

У =setup.el= есть одна особенность, которую следует учитывать. Это *крайне* примитивный набор макросов, который не позволяет так свободно распоряжаться порядком загрузки пакетов, как, например, =use-package=. Поэтому очень важным является порядок, в котором блоки располагаются внутри файла, так как загружаемый в данный момент блок не знает ничего о блоках, загружаемых после него. В текущей конфигурации это было существенно для нормальной работы =nerd-icons= с прочими пакетами.

Это, конечно, снижает удобство настройки, но ускоряет запуск. С =use-package= я добивался минимум 6.5 секунд, =setup.el= держит ее на уровне 3.5-5.5 секунд, что я склонен связывать именно с отсутствием автоматического распределения порядка запуска.

#+begin_src elisp
(straight-use-package '(setup :type git :host nil :repo "https://git.sr.ht/~pkal/setup"))
(require 'setup)
#+end_src

Данный суб-макрос автоматически устанавливает пакет при помощи =straight.el=, если таковой еще не установлен. Макрос понимает как имена пакетов, так и рецепты. Имя первого пакета задает контекст для =setup=.

#+begin_src emacs-lisp
(setup-define :straight
    (lambda (recipe)
        `(unless (straight-use-package ',recipe)
             ,(setup-quit)))
    :documentation "Install RECIPE with `straight-use-package'.
This macro can be used as HEAD, and will replace itself with the
first RECIPE's package."
    :repeatable t
    :shorthand (lambda (sexp)
                   (let ((recipe (cadr sexp)))
                       (if (consp recipe)
                               (car recipe)
                           recipe))))
#+end_src

Следующий суб-макрос --- это мое творение, правда, основанное на нескольких других суб-макросах. Он делает так, чтобы некоторый код исполнялся строго после загрузки указанных пакетов.

#+begin_src emacs-lisp
(setup-define :eval-after
    (lambda (features &rest body)
        (let ((body `(progn ,@body))
              (features (if (listp features)
                                features
                            (list features))))
            (dolist (feature (nreverse features))
                (setq body `(with-eval-after-load ',feature ,body)))
            body))
    :documentation "Evaluate BODY after FEATURES are loaded."
    :indent 1)
#+end_src

Суб-макрос для модификации функций пр помощи =advice=.

#+begin_src emacs-lisp
(setup-define :advice
    (lambda (symbol where function)
        `(advice-add ',symbol ,where ,(setup-ensure-function function)))
    :documentation "Add a piece of advice on a function.
See `advice-add' for more details."
    :after-loaded t
    :debug '(sexp sexp function-form)
    :repeatable t)
#+end_src

Следующий суб-макрос имеет крайне странное описание, из которого что-либо понять весьма затруднительно. На самом деле он ограничивает блок кода, в котором может быть инициирован выход из макроса. Обычно, такое событие приводит к завершению исполнения тела макроса. Суб-макрос же позволяет прекратить исполнение ограниченного кода, не прерывая исполнение всего тела макроса.

#+begin_src emacs-lisp
(setup-define :with-local-quit
    (lambda (&rest body)
        `(catch ',(setup-get 'quit)
             ,@body))
    :documentation "Prevent any reason to abort from leaving beyond BODY."
    :debug '(setup))
#+end_src

И, наконец, суб-макрос, вызывающий безусловный выход из тела макроса (ну или из ограниченного блока кода).

#+begin_src emacs-lisp
(setup-define :quit
    #'setup-quit
    :documentation "Unconditionally abort the evaluation of the current body.")
#+end_src

* Общие настройки

Заставляем Emacs использовать =utf-8= как стандартную кодовую таблицу.

#+begin_src emacs-lisp
(set-language-environment 'utf-8)
(setq locale-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-selection-coding-system
 (if (eq system-type 'windows-nt)
         'utf-16-le
     'utf-8))
(prefer-coding-system 'utf-8)
#+end_src

Emacs по умолчанию требует длинные ответы на вопросы (=yes= и =no=). Следующие настройки позволяют ограничиться одной буквой (=y= и =n=).

#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
(setq confirm-kill-emacs 'y-or-n-p)
#+end_src

Следовать ли автоматически по символьным ссылкам.

#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src

** Сохранение истории команд и позиций

=saveplace= --- встроенный пакет, позволяющий сохранять позицию в редактируемых файлах. При повторном открытии курсор (=point=) будет автоматически размещен в сохраненной позиции.

#+begin_src emacs-lisp
(setup saveplace
    (:option save-place-file (expand-file-name
                              (format "%s/var/%s"
                                      user-emacs-directory
                                      "save-place.el")))
    (save-place-mode t))

#+end_src

=savehist= --- другой встроенный пакет, сохраняющий историю введенных команд между сессиями. По умолчанию Emacs сохраняет историю *только* в пределах текущей сессии.

#+begin_src emacs-lisp
(setup savehist
    (:option history-delete-duplicates t
             savehist-file (expand-file-name
                            (format "%s/var/%s"
                                    user-emacs-directory
                                    "savehist.el")))
    (savehist-mode t))
#+end_src

