init.org
** Стартовый экран

Красивый [[https://github.com/emacs-dashboard/emacs-dashboard][стартовый экран]]. Очень удобный, к слову. Показывает ссылки на последние файлы и проекты, плюс я вывел ссылки на файлы и репозиторий настроек Emacs.

#+begin_src emacs-lisp
(setup (:straight dashboard)
    (:also-load nerd-icons)
    (:option dashboard-display-icons-p t
             dashboard-icon-type 'nerd-icons
             dashboard-set-heading-icons t
             dashboard-set-file-icons t
             dashboard-items '((recents . 15)
                               (projects . 5))
             dashboard-startup-banner (expand-file-name
                                       "emacs.png"
                                       (file-name-directory user-init-file))
             dashboard-set-navigator t
             dashboard-navigator-buttons
             `((
                (,(nerd-icons-sucicon "nf-custom-emacs" :height 1.0 :v-adjust 0.0)
                 "Настройки"
                 "Открыть файл с настройками (init.el)"
                 (lambda (&rest _)
                     (find-file (concat (file-name-directory user-init-file) "init.org"))))
                (,(nerd-icons-faicon "nf-fa-github" :height 1.0 :v-adjust 0.0)
                 "dotfiles"
                 "Github с конфигурационными файлами"
                 (lambda (&rest _) (browse-url "https://github.com/vadim-zyamalov/dotfiles")))
                (,(nerd-icons-faicon "nf-fa-github" :height 1.0 :v-adjust 0.0)
                 "emacs"
                 "Github с настройками Emacs"
                 (lambda (&rest _) (browse-url "https://github.com/vadim-zyamalov/emacs")))
                )))
    (dashboard-setup-startup-hook))
#+end_src

** Отображение строк

Vim умеет красиво отображать номер текущей строки и относительные номера соседних строк. Emacs тоже так умеет. Это имеет смысл для поклонников =Evil Mode=, так как облегчает перемещение между строками, но и просто так тоже красиво.

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)
#+end_src

Просим показывать нам аккуратные стрелочки на границе *визуально* разбитой и перенесенной строки.

#+begin_src emacs-lisp
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(global-visual-line-mode t)
#+end_src

Очень полезный пакет [[https://gitlab.com/protesilaos/pulsar][pulsar]]. Он визуально подсвечивает текущую строку при наступлении некоторого события, например, при смене окна. Это облегчает работу, так как позволяет не искать курсор по всему экрану.

#+begin_src emacs-lisp
(setup (:straight pulsar)
    (:option pulsar-pulse t
             pulsar-delay 0.055
             pulsar-pulse-functions '(recenter-top-bottom
                                      move-to-window-line-top-bottom
                                      reposition-window
                                      bookmark-jump
                                      other-window
                                      delete-window
                                      delete-other-windows
                                      forward-page
                                      backward-page
                                      scroll-up-command
                                      scroll-down-command
                                      windmove-right
                                      windmove-left
                                      windmove-up
                                      windmove-down
                                      windmove-swap-states-right
                                      windmove-swap-states-left
                                      windmove-swap-states-up
                                      windmove-swap-states-down
                                      tab-new
                                      tab-close
                                      tab-next
                                      org-next-visible-heading
                                      org-previous-visible-heading
                                      org-forward-heading-same-level
                                      org-backward-heading-same-level
                                      outline-backward-same-level
                                      outline-forward-same-level
                                      outline-next-visible-heading
                                      outline-previous-visible-heading
                                      outline-up-heading
                                      ctrlf-forward-default
                                      ctrlf-backward-default
                                      ctrlf-forward-alternate
                                      ctrlf-backward-alternate
                                      ctrlf-forward-symbol
                                      ctrlf-forward-symbol-at-point
                                      consult-line))
    (pulsar-global-mode t))
#+end_src

** Отображение окон

Иногда во фрейма Emacs мы имеем несколько окон. Пакет [[https://github.com/cyrus-and/zoom][zoom]] автоматически изменяет размеры окон так, чтобы активное имело нужный размер.

#+begin_src emacs-lisp :tangle no
(setup (:straight zoom)
    (:option zoom-size '(0.618 . 0.618)
             zoom-ignored-major-modes '(ess-r-mode
                                        inferior-ess-r-mode
                                        ess-rdired-mode)
             zoom-ignored-buffer-names '("*R*"
                                         "*R dired*"
                                         "*R view*"))
    (zoom-mode))
#+end_src

Другой пакет, [[https://github.com/gonewest818/dimmer.el][dimmer]], делает неактивные окна более тусклыми, что дополнительно вызуально выделяет активное.

#+begin_src emacs-lisp
(setup (:straight dimmer)
    (:option dimmer-fraction 0.6
             dimmer-watch-frame-focus-events nil)
    (dimmer-configure-which-key)
    (add-to-list 'dimmer-buffer-exclusion-regexps "^.*\\*corfu\\*.*$")
    (add-to-list 'dimmer-buffer-exclusion-regexps "^.*\\*corfu-popupinfo\\*.*$")
    (dimmer-mode t))
#+end_src

Пакет [[https://www.emacswiki.org/emacs/download/framemove.el][framemove]], конечно, не связан с отображением активных окон напрямую, но позволяет удобно их менять. Строго говоря, пакет расширяет встроенный функционал перемещения между окнами *windmove*, позволяя перемещаться между фреймами. Пока не использую.

| Клавиша | Карта      | Команда        | Действие                    |
|---------+------------+----------------+-----------------------------|
| =<f6>=    | global     |                | Вход в тело "гидры"         |
| =<left>=  | hydra-wind | windmove-left  | Переход в окно/фрейм слева  |
| =<right>= | hydra-wind | windmove-right | Переход в окно/фрейм справа |
| =<up>=    | hydra-wind | windmove-up    | Переход в окно/фрейм сверху |
| =<down>=  | hydra-wind | windmove-down  | Переход в окно/фрейм снизу  |

#+begin_src emacs-lisp :tangle no
(setup (:straight framemove)
    (:option framemove-hook-into-windmove t)
    (:eval-after hydra
        (defhydra hydra-wind (global-map "<f6>")
            "Moving between windows"
            ("<left>"  windmove-left  "left")
            ("<right>" windmove-right "right")
            ("<up>"    windmove-up    "up")
            ("<down>"  windmove-down  "down"))))
#+end_src

Пакет [[https://github.com/abo-abo/ace-window][Ace Window]] делает то же, что и =framemove=, но немного иначе. Если во фрейме всего два окна, то вызов команды =ace-window= приводит к переключению между окнами. Если больше, то на каждом окне появляется некое значение (по умолчанию от 1 до 9). При нажатии на соответствующую клавишу осуществляется переход в это окно.

| Клавиша     | Карта  | Команда    | Действие                                               |
|-------------+--------+------------+--------------------------------------------------------|
| =M-o=         | global | ace-window | Переключение между окнами                              |
| =C-u M-o=     | global |            | Поменять текущее окно местами с выбранным (или другим) |
| =C-u C-u M-o= | global |            | Удалить выбранное окно (или другое)                    |

#+begin_src emacs-lisp
(setup (:straight ace-window)
    (:global "M-o" ace-window))
#+end_src

