init.el

(setup (:straight dashboard)
    (:also-load nerd-icons)
    (:option dashboard-display-icons-p t
             dashboard-icon-type 'nerd-icons
             dashboard-set-heading-icons t
             dashboard-set-file-icons t
             dashboard-items '((recents . 15)
                               (projects . 5))
             dashboard-startup-banner (expand-file-name
                                       "it-people.png"
                                       (file-name-directory user-init-file))
             dashboard-set-navigator t
             dashboard-navigator-buttons
             `((
                (,(nerd-icons-sucicon "nf-custom-emacs" :height 1.0 :v-adjust 0.0)
                 "Настройки"
                 "Открыть файл с настройками (init.el)"
                 (lambda (&rest _)
                     (find-file (concat (file-name-directory user-init-file) "init.org"))))
                (,(nerd-icons-faicon "nf-fa-github" :height 1.0 :v-adjust 0.0)
                 "dotfiles"
                 "Github с конфигурационными файлами"
                 (lambda (&rest _) (browse-url "https://github.com/vadim-zyamalov/dotfiles")))
                (,(nerd-icons-faicon "nf-fa-github" :height 1.0 :v-adjust 0.0)
                 "emacs"
                 "Github с настройками Emacs"
                 (lambda (&rest _) (browse-url "https://github.com/vadim-zyamalov/emacs")))
                )))
    (dashboard-setup-startup-hook))

(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)

(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(global-visual-line-mode t)

(setup (:straight pulsar)
    (:option pulsar-pulse t
             pulsar-delay 0.055
             pulsar-pulse-functions '(recenter-top-bottom
                                      move-to-window-line-top-bottom
                                      reposition-window
                                      bookmark-jump
                                      other-window
                                      delete-window
                                      delete-other-windows
                                      forward-page
                                      backward-page
                                      scroll-up-command
                                      scroll-down-command
                                      windmove-right
                                      windmove-left
                                      windmove-up
                                      windmove-down
                                      windmove-swap-states-right
                                      windmove-swap-states-left
                                      windmove-swap-states-up
                                      windmove-swap-states-down
                                      tab-new
                                      tab-close
                                      tab-next
                                      org-next-visible-heading
                                      org-previous-visible-heading
                                      org-forward-heading-same-level
                                      org-backward-heading-same-level
                                      outline-backward-same-level
                                      outline-forward-same-level
                                      outline-next-visible-heading
                                      outline-previous-visible-heading
                                      outline-up-heading
                                      ctrlf-forward-default
                                      ctrlf-backward-default
                                      ctrlf-forward-alternate
                                      ctrlf-backward-alternate
                                      ctrlf-forward-symbol
                                      ctrlf-forward-symbol-at-point
                                      consult-line))
    (pulsar-global-mode t))

(setup (:straight dimmer)
    (:option dimmer-fraction 0.6
             dimmer-watch-frame-focus-events nil)
    (dimmer-configure-which-key)
    (add-to-list 'dimmer-buffer-exclusion-regexps "^.*\\*corfu\\*.*$")
    (add-to-list 'dimmer-buffer-exclusion-regexps "^.*\\*corfu-popupinfo\\*.*$")
    (dimmer-mode t))

(setup (:straight framemove)
    (:option framemove-hook-into-windmove t)
    (defhydra hydra-wind (global-map "<f6>")
        "Moving between windows"
        ("<left>"  windmove-left  "left")
        ("<right>" windmove-right "right")
        ("<up>"    windmove-up    "up")
        ("<down>"  windmove-down  "down")))

(setup (:straight ace-window)
    (:global "M-o" ace-window))
