init.org
** Дерево каталогов проекта

Достаточно удобное [[https://github.com/jaypei/emacs-neotree][дерево каталогов]] текущего проекта, позволяющее, помимо переключения между файлами, производить несложные операции с ними.

| Клавиша | Карта  | Команда        | Действие              |
|---------+--------+----------------+-----------------------|
| =C-x t t= | global | neotree-toggle | Показ/скрытие NeoTree |

#+begin_src emacs-lisp :tangle no
(setup (:straight neotree)
    (:option neo-smart-open t
             neo-window-width 40
             neo-theme (if (display-graphic-p) 'icons 'arrow))
    (:global "C-x t t" neotree-toggle))
#+end_src

Еще одно удобное [[https://github.com/Alexander-Miller/treemacs/][дерево]], ориентированное на работу с проектами: по умолчанию в нем нужно загрузить нужные папки/проекты, между которыми можно быстро переключаться. Так как мне такая функциональность не нужна, то я настроил его на показ дерева *текущего* проекта.

| Клавиша   | Карта  | Команда                       | Действие                                                                                    |
|-----------+--------+-------------------------------+---------------------------------------------------------------------------------------------|
| =C-x t t=   | global | treemacs                      | Запуск treemacs                                                                             |
| =M-0=       | global | treemacs-select-window        | Либо запуск treemacs, либо вызов его окна, либо переключение между treemcs и другими окнами |
| =C-x t 1=   | global | treemacs-delete-other-windows | Закрытие других окон с сохранением окна treemacs                                            |
| =C-x t d=   | global | treemacs-select-directory     | Добавление в treemacs новой корневой папки                                                  |
| =C-x t C-t= | global | treemacs-find-file            | Поиск файла в дереве в окне treemacs                                                        |
| =C-x t M-t= | global | treemacs-find-tag             | Поиск тега в дереве в окне treemacs                                                         |

#+begin_src emacs-lisp
(setup (:straight treemacs
                  treemacs-magit
                  treemacs-nerd-icons)
    (:option treemacs-python-executable "python")
    (:require treemacs
              treemacs-magit
              treemacs-nerd-icons)
    (treemacs-fringe-indicator-mode 'always)
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-project-follow-mode t)
    (treemacs-load-theme "nerd-icons")
    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))
    (:global "M-0"       treemacs-select-window
             "C-x t 1"   treemacs-delete-other-windows
             "C-x t t"   treemacs
             "C-x t d"   treemacs-select-directory
             "C-x t B"   treemacs-bookmark
             "C-x t C-t" treemacs-find-file
             "C-x t M-t" treemacs-find-tag))
#+end_src

* Настройки справки

Пакет [[https://github.com/minad/marginalia][Marginalia]] увеличивает объем дополнительной информации, отображаемой в минибуферах для различных команд.

#+begin_src emacs-lisp
(setup (:straight marginalia)
    (:eval-after all-the-icons-completion
        (:hook all-the-icons-completion-marginalia-setup))
    (:eval-after nerd-icons-completion
        (:hook nerd-icons-completion-marginalia-setup))
    (marginalia-mode))
#+end_src

[[https://github.com/justbur/emacs-which-key][Which Key]] помогает пользователю с комбинациями клавиш, коих в Emacs вагон и маленькая телега. Например, через 1 секунду после нажатия =C-x= появится минибуфер со списком возможных продолжений.

#+begin_src emacs-lisp
(setup (:straight which-key)
    (:option which-key-idle-delay 1)
    (which-key-mode))
#+end_src

Пакет [[https://github.com/Wilfred/helpful][Helpful]] модифицирует и форматирует окна с документацией по функциям, переменным и т.д.

| Клавиша | Карта  | Команда          | Действие                                            |
|---------+--------+------------------+-----------------------------------------------------|
| =C-h f=   | global | helpful-callable | Справка по вызываемым символам: функциям и макросам |
| =<f1> f=  | global | helpful-callable | То же самое                                         |
| =C-h v=   | global | helpful-variable | Справка по переменным                               |
| =<f1> v=  | global | helpful-variable | Справка по переменным                               |
| =C-h k=   | global | helpful-key      | Справка по клавишам                                 |
| =C-h C=   | global | helpful-command  | Справка по командам                                 |

#+begin_src emacs-lisp
(setup (:straight helpful)
    (:global [remap describe-function] helpful-callable
             "<f1> f" helpful-callable
             [remap describe-variable] helpful-variable
             "<f1> v" helpful-variable
             [remap describe-key] helpful-key
             "C-h C" helpful-command))
#+end_src

* Настройки ввода

** Мышь

Следующие настройки меняют настройки прокрутки буферов при помощи мыши, а также включают изменение размера текста при помощи колеса прокрутки. Стандартные настройки приводят к чрезвычайно стремительному перемещению по тексту.

#+begin_src emacs-lisp
(setq mouse-wheel-scroll-amount '(1
                                  ((shift) . 5)
                                  ((meta))
                                  ((control) . text-scale))
      mouse-wheel-progressive-speed nil)

(setq auto-window-vscroll nil
      fast-but-imprecise-scrolling t
      scroll-conservatively 101
      scroll-margin 0
      scroll-preserve-screen-position t)

(when (>= emacs-major-version 29)
    (pixel-scroll-precision-mode))
#+end_src

[[https://github.com/abo-abo/hydra][Hydra]] позволяет снизить число нажатий клавиш при цепочке последовательных нажатий: достаточно ввести начальную комбинацию, затем ее можно опустить.

#+begin_src emacs-lisp
(setup (:straight hydra)
       (require 'hydra))
#+end_src

** Клавиатура

Используем клавишу =ESC= для прерывания всего и вся. Работает не так хорошо, как =C-g=, но тем не менее.

#+begin_src emacs-lisp
(define-key global-map (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

Настраиваем клавиши для изменения размера текста.

| Клавиша | Карта  | Команда | Действие                       |
|---------+--------+---------+--------------------------------|
| =C-==     | global |         | Сброс изменения размера текста |
| =C-+=     | global |         | Увеличение масштаба            |
| =C--=     | global |         | Уменьшение масштаба            |

#+begin_src emacs-lisp
(define-key global-map (kbd "C-=") #'(lambda ()
                                         (interactive)
                                         (text-scale-set 0)))
(define-key global-map (kbd "C-+") #'(lambda ()
                                         (interactive)
                                         (text-scale-increase 1.1)))
(define-key global-map (kbd "C--") #'(lambda ()
                                         (interactive)
                                         (text-scale-decrease 1.1)))
#+end_src

Убираем комбинацию клавиш, ранее использованную для отмены, так как она может путаться с комбинациями, приведенными выше.

#+begin_src emacs-lisp
(define-key global-map (kbd "C-_") nil)
#+end_src

[[https://github.com/a13/reverse-im.el][Reverse-IM]]... На данный пакет должны молиться все, кто пользуется несколькими раскладками клавиатуры. Пакет позволяет не переключать раскладку для ввода комбинаций клавиш. Не работает для ответов на вопрос =y= или =n=, тут надо, все-таки, переключать.

#+begin_src emacs-lisp
(setup (:straight reverse-im)
    (:option reverse-im-input-methods '("russian-computer"))
    (reverse-im-mode t))
#+end_src

[[https://www.emacswiki.org/emacs/CuaMode][Cua Mode]] позволяет использовать стандартные комбинации клавиш =C-x=, =C-c=, =C-v=. Тут есть сложность: если есть активный регион (выделение), и нужно ввести комбинацию клавиш, включающую =C-x= или =C-c=, то нужно либо дважды быстро ввести нужное начало, либо использовать начало =C-S-x= или =C-S-c=.

#+begin_src emacs-lisp
(unless init/evil
    (setup cua
        (:option cua-keep-region-after-copy t)
        (cua-mode t)
        (transient-mark-mode t)))
#+end_src

* Зло и коварство: Evil mode

Зло и коварство! В Emacs можно работать как в Vi/Vim/Neovim. [[https://github.com/emacs-evil/evil][Evil-mode]] позволяет достичь этого легко и просто. Мне нравится работать в Neovim, но в нем есть определенные ограничения в силу его консольности.

#+begin_src emacs-lisp
(when init/evil
    (setup (:straight evil
                      evil-collection
                      evil-surround
                      evil-nerd-commenter
                      evil-mc)
        (:option evil-want-integration t
                 evil-want-keybinding nil
                 evil-want-C-u-scroll t
                 evil-want-C-i-jump nil
                 evil-undo-system 'undo-redo
                 evil-respect-visual-line-mode t)
        (evil-mode 1)
        (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
        (evil-global-set-key 'motion "j" 'evil-next-visual-line)
        (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
        (evil-set-initial-state 'messages-buffer-mode 'normal)
        (evil-set-initial-state 'dashboard-mode 'normal)

        (global-evil-surround-mode 1)
        (evil-collection-init)
        (evilnc-default-hotkeys)

        (evil-define-key 'visual evil-mc-key-map
                         "A" #'evil-mc-make-cursor-in-visual-selection-end
                         "I" #'evil-mc-make-cursor-in-visual-selection-beg)
        (global-evil-mc-mode 1)))
#+end_src

* Настройки редактирования

Если регион активен (то есть активно выделение), то начало ввода очищает выделение.

#+begin_src emacs-lisp
(delete-selection-mode t)
#+end_src

** Настройки сохранения

Удаление пробелов в конце строк во время сохранения.

#+begin_src emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

Добавление пустой строки при сохранении.

#+begin_src emacs-lisp
(setq require-final-newline t)
#+end_src

** Настройки отступов

Настраиваем ширину табуляции в 4 пробела, а также запрещаем отступы знаками табуляции.

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil
              tab-width 4
              c-basic-offset 4
              standart-indent 4
              lisp-body-indent 4)
#+end_src

Активация встроенного механизма автоматической расстановки отступов. Попробовал [[https://github.com/Malabarba/aggressive-indent-mode][aggressive-indent-mode]], но он оказался слишком агрессивным.

#+begin_src emacs-lisp
(electric-indent-mode t)
#+end_src

#+begin_src emacs-lisp :tangle no
(setup (:straight aggressive-indent)
    (:hook-into prog-mode
                LaTeX-mode))
#+end_src

Настраиваем поведение клавиши =RET=: при нажатии на нее происхоит не только перенос строки, но и коррекция отступа введенной строки.

#+begin_src emacs-lisp
(define-key global-map (kbd "RET") 'newline-and-indent)
#+end_src

Визуально показываем уровни отступа при помощи [[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides]].

#+begin_src emacs-lisp :tangle no
(setup (:straight highlight-indent-guides)
    (:option highlight-indent-guides-method 'character
             highlight-indent-guides-responsive 'top)
    (:require highlight-indent-guides)
    ;; (set-face-background 'highlight-indent-guides-odd-face "darkgray")
    ;; (set-face-background 'highlight-indent-guides-even-face "darkgray")
    ;; (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
    (:hook-into prog-mode))
#+end_src

Либо при помощи [[https://github.com/jdtsmith/indent-bars][indent-bars]].

#+begin_src emacs-lisp
(setup (:straight (indent-bars
                   :type git
                   :host github
                   :repo "jdtsmith/indent-bars"))
    (:option indent-bars-prefer-character t
             indent-bars-treesit-support t
             indent-bars-no-descend-string t
             indent-bars-treesit-ignore-blank-lines-types '("module")
             indent-bars-treesit-wrap '((python argument_list parameters ; for python, as an example
                                                list list_comprehension
                                                dictionary dictionary_comprehension
                                                parenthesized_expression subscript)))
    (:hook-into prog-mode))
#+end_src

** Настройки отмены и повтора

Пакет [[https://gitlab.com/tsc25/undo-tree][Undo Tree]] заменяет стандартный механизм отмены и повтора. Главное отличие: история отмены и повторов отображается в виде дерева, вместо стандартного линейного представления Emacs, что делает отмену более удобной при более предсказуемом поведении.

| Клавиша | Карта  | Команда        | Действие        |
|---------+--------+----------------+-----------------|
| =C-z=     | global | undo-tree-undo | Отмена действий |
| =C-S-z=   | global | undo-tree-redo | Повтор действий |

#+begin_src emacs-lisp
(setup (:straight undo-tree)
    (global-undo-tree-mode)
    (:with-map global-map
        (:unbind "C-z"
                 "C-_"
                 "C-M-_"))
    (:global "C-z" undo-tree-undo
             "C-S-z" undo-tree-redo)
    (:bind-into cua--cua-keys-keymap
        "C-z" undo-tree-undo))
#+end_src

