init.el

(setup (:straight treemacs
                  treemacs-magit
                  treemacs-nerd-icons)
    (:option treemacs-python-executable "python")
    (:require treemacs
              treemacs-magit
              treemacs-nerd-icons)
    (treemacs-fringe-indicator-mode 'always)
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-project-follow-mode t)
    (treemacs-load-theme "nerd-icons")
    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))
    (:global "M-0"       treemacs-select-window
             "C-x t 1"   treemacs-delete-other-windows
             "C-x t t"   treemacs
             "C-x t d"   treemacs-select-directory
             "C-x t B"   treemacs-bookmark
             "C-x t C-t" treemacs-find-file
             "C-x t M-t" treemacs-find-tag))

(setup (:straight marginalia)
    (with-eval-after-load 'all-the-icons-completion
        (:hook all-the-icons-completion-marginalia-setup))
    (with-eval-after-load 'nerd-icons-completion
        (:hook nerd-icons-completion-marginalia-setup))
    (marginalia-mode))

(setup (:straight which-key)
    (:option which-key-idle-delay 1)
    (which-key-mode))

(setup (:straight helpful)
    (:global [remap describe-function] helpful-callable
             "<f1> f" helpful-callable
             [remap describe-variable] helpful-variable
             "<f1> v" helpful-variable
             [remap describe-key] helpful-key
             "C-h C" helpful-command))
