init.org
** Настройки отражения скобок

Активация подсветки парных скобок.

#+begin_src emacs-lisp
(show-paren-mode t)
#+end_src

Пакет [[https://github.com/Fanael/rainbow-delimiters][Rainbow Delimeters]] раскрашивает парные скобки в зависимости от глубины вложенности.

#+begin_src emacs-lisp
(setup (:straight rainbow-delimiters)
    (:hook-into prog-mode org-mode))
#+end_src

Пакет [[https://github.com/Fuco1/smartparens][Smartparens]] автоматически добавляет закрывающие скобки, причем и довольно сложные, такие как скобки LaTeX. Также пакет добавляет функции для смены окружающих скобок и их удаления.

| Клавиша | Карта  | Команда        | Действие                   |
|---------+--------+----------------+----------------------------|
| =C-c b r= | global | sp-rewrap-sexp | Смена окружающих скобок    |
| =C-c b d= | global | sp-splice-sexp | Удаление окружающих скобок |

#+begin_src emacs-lisp :noweb
(unless init/evil
    (setup (:straight smartparens)
        (:require smartparens-config)
        (:bind "C-c b r" sp-rewrap-sexp
               "C-c b d" sp-splice-sexp)
        (smartparens-global-mode t)
        (sp-with-modes '(tex-mode
                         latex-mode
                         LaTeX-mode)
                       (sp-local-pair "<<" ">>"
                                      :unless '(sp-in-math-p)))))

(when init/evil
    (electric-pair-mode t))
#+end_src

** Настройки комментирования

[[https://stackoverflow.com/a/9697222][Данная функция]] позволяет одной комбинацией клавиш закомментировать либо строку, либо регион.

| Клавиша | Карта  | Команда | Действие                           |
|---------+--------+---------+------------------------------------|
| =M-;=     | global |         | Комментирование строки или региона |

#+begin_src emacs-lisp
(unless init/evil
    (defun comment-or-uncomment-region-or-line ()
        "Comments or uncomments the region or the current line."
        (interactive)
        (let (beg end)
            (if (region-active-p)
                    (setq beg (region-beginning) end (region-end))
                (setq beg (line-beginning-position) end (line-end-position)))
            (comment-or-uncomment-region beg end)
            (forward-line)))

    (global-set-key (kbd "M-;") 'comment-or-uncomment-region-or-line))
#+end_src

** Настройки замены

[[https://github.com/benma/visual-regexp.el][Visual Regexp]] показывает результат предположительной замены. Причем понимает регулярные выражения.

| Клавиша | Карта  | Команда          | Действие                                                    |
|---------+--------+------------------+-------------------------------------------------------------|
| =M-%=     | global | vr/replace       | Визуальная замена                                           |
| =C-M-%=   | global | vr/query-replace | Последовательная визуальная замена                          |
| =C-c v m= | global | vr/mc-mark       | Создание нескольких курсоров согласно регулярномы выражению |

#+begin_src emacs-lisp
(unless init/evil
    (defun my/vr/replace ()
        "Replace in whole buffer."
        (interactive)
        (if (region-active-p)
                (call-interactively #'vr/replace)
            (save-excursion
                (goto-char (point-min))
                (call-interactively #'vr/replace))))

    (defun my/vr/query-replace ()
        "Replace in whole buffer."
        (interactive)
        (if (region-active-p)
                (call-interactively #'vr/query-replace)
            (save-excursion
                (goto-char (point-min))
                (call-interactively #'vr/query-replace))))

    (setup (:straight visual-regexp)
        (:require visual-regexp)
        (:global "M-%" my/vr/replace
                 "C-M-%" my/vr/query-replace
                 "C-c v m" vr/mc-mark)))
#+end_src

Пакет [[https://github.com/magnars/multiple-cursors.el][Multiple Cursors]] позволяет создавать несколько курсоров, либо выделяющих одинаковый текст в разных строках, либо создающих столбец из курсоров.

| Клавиша | Карта  | Команда                    | Действие                                        |
|---------+--------+----------------------------+-------------------------------------------------|
| =C-c m l= | global | mc/edit-lines              | Создание нескольких курсоров в пределах региона |
| =C->=     | global | mc/mark-next-like-this     | Создание курсора на следующем вхождении слова   |
| =C-<=     | global | mc/mark-previous-like this | Создание курсора на предыдущем вхождении слова  |
| =C-c m a= | global | mc/mark-all-like-this      | Создание курсоров на всех вхождениях слова      |

#+begin_src emacs-lisp
(unless init/evil
    (setup (:straight multiple-cursors)
        (:option mc/match-cursor-style nil)
        (:global "C-c m l" mc/edit-lines
                 "C->" mc/mark-next-like-this
                 "C-<" mc/mark-previous-like-this
                 "C-c m a" mc/mark-all-like-this)))
#+end_src

** Полезные команды

[[https://github.com/bbatsov/crux][Crux]] --- набор различных полезных функций.

| Клавиша      | Карта  | Команда                                           | Действие                                             |
|--------------+--------+---------------------------------------------------+------------------------------------------------------|
| =C-c I=        | global | crux-find-user-init-file                          | Перейти к пользовательскому файлу =init.el=            |
| =C-c d=        | global | crux-duplicate-current-line-or-region             | Создать дубликат строки или региона                  |
| =C-c M-d=      | global | crux-duplicate-and-comment-current-line-or-region | Создать *комментированный* дубликат строки или региона |
| =S-<return>=   | global | crux-smart-open-line                              | Создать строку после текущей (как =o= в =Vim=)           |
| =C-S-<return>= | global | crux-smart-open-line-above                        | Создать строку перед текущей (как =O= в =Vim=)           |

#+begin_src emacs-lisp
(setup (:straight crux)
    (:require crux)
    (:bind-into global-map
        "C-c I" crux-find-user-init-file
        "C-c d" crux-duplicate-current-line-or-region
        "C-c M-d" crux-duplicate-and-comment-current-line-or-region
        "S-<return>" crux-smart-open-line
        "C-S-<return>" crux-smart-open-line-above))
#+end_src

* Настройки автодополнения

** Вспомогательные функции

Так как в файле =init.el= есть возможность выбора механизмов автодополнения, то для максимальной унификации настроек я написал вспомогательные функции, вызывающие нужные компоненты.

#+begin_src emacs-lisp
(setup (:straight cape))
#+end_src

Первая функция запускает нужный клиент LSP: =LSP-mode= или =Eglot=.

#+begin_src emacs-lisp
(defun lsp/lsp ()
    "Using an appropriate LSP-engine."
    (if init/lsp-mode
            (lsp)
        (eglot-ensure)))
#+end_src

Клиенты LSP добавляют свои собственные CAPF (Conpletion at Point Function). Однако, эти CAPF являются `жадными`: если они не могут предоставить пользователю результат, то дальнейший поиск вариантов автодополнения останавливается. Так как я настраиваю поиск вариантов автодополнения из нескольких источников, то такое поведение неприемлемо.

#+begin_src emacs-lisp
(defun lsp/non-greedy-lsp-mode ()
    "Making LSP capf non-greedy."
    (progn
        (fset 'non-greedy-lsp
              (cape-capf-properties #'lsp-completion-at-point :exclusive 'no))
        (setq completion-at-point-functions
              (list #'non-greedy-lsp))))

(defun lsp/non-greedy-eglot ()
    "Making Eglot capf non-greedy."
    (progn
        (fset 'non-greedy-eglot
              (cape-capf-properties #'eglot-completion-at-point :exclusive 'no))
        (setq completion-at-point-functions
              (list #'non-greedy-eglot))))
#+end_src

При открытии некоторых видов файлов и соответствующих языковых серверов в список CAPF добавляются дополнительные источники вариантов автодополнения. Следующая функция предназначена для автоматического запуска вспомогательных функций, добавляющих оные. Эти вспомогательные функции должжны иметь имя =capf/<major-mode>=.

#+begin_src emacs-lisp
(defun lsp/extra-capf ()
    "Adding extra capf during LSP startup."
    (let ((tmp-symbol (intern (concat "capf/" (symbol-name major-mode)))))
        (unless (null (symbol-function tmp-symbol))
            (funcall (symbol-function tmp-symbol)))))
#+end_src

** LSP

Устанавливаем и запускаем =LSP-mode= или =Eglot=. При их запуске выполняются два хука: первый делает соответствующий CAPF `щедрым`, а второй --- добавляет дополнительные CAPF.

| Клавиша | Карта        | Команда         | Действие                               |
|---------+--------------+-----------------+----------------------------------------|
| =C-c l=   | lsp-mode-map | lsp-command-map | Префикс для комбинаций клавиш LSP-mode |

| Клавиша | Карта          | Команда                            | Действие                                             |
|---------+----------------+------------------------------------+------------------------------------------------------|
| =C-c l r= | eglot-mode-map | eglot-rename                       | Переименовать символ под курсором                    |
| =C-c l o= | eglot-mode-map | eglot-code-action-organize-imports | Форматирование списка импортированных файлов/модулей |
| =C-c l h= | eglot-mode-map | eldoc                              | Справка Eldoc                                        |
| =C-c l d= | eglot-mode-map | xref-find-definitions              | Переход к определению символа                        |

#+begin_src emacs-lisp
(when init/lsp-mode
    (setup (:straight lsp-mode)
        (:option lsp-enable-file-watchers nil
                 lsp-keymap-prefix "C-c l")
        (unless init/corfu
            (:option lsp-completion-provider :none))
        (with-eval-after-load 'lsp-mode
            (define-key lsp-mode-map (kbd "C-c l") lsp-command-map))
        (:hook lsp-enable-which-key-integration)
        (:with-mode lsp-completion-mode
            (:hook (lambda ()
                       (progn
                           (lsp/non-greedy-lsp-mode)
                           (lsp/extra-capf)))))))

(unless init/lsp-mode
    (setup (:straight eglot)
        (:bind "C-c l r" eglot-rename
               "C-c l o" eglot-code-action-organize-imports
               "C-c l h" eldoc
               "C-c l d" xref-find-definitions)
        (:eval-after eglot
            (add-to-list 'eglot-server-programs
                         '(latex-mode . ("texlab"))))
        (:with-mode eglot-managed-mode
            (:hook (lambda ()
                       (progn
                           (lsp/non-greedy-eglot)
                           (lsp/extra-capf)))))))
#+end_src

