init.org
** Corfu или Company

[[https://github.com/minad/corfu][Corfu]] --- минималистичное всплывающее окно для автодополнения. Не требует дополнительных `бэкендов` для работы, использует встроенную в Emacs функциональность. Также устанавливается пакет [[https://github.com/galeo/corfu-doc][Corfu-doc]], добавляющий всплявающее окно со справкой. Для визуальных красот устанавливается пакет [[https://github.com/jdtsmith/kind-icon][Kind-icon]], добавляющий красивые иконки. Пакет [[https://github.com/minad/cape][Cape]] содержит набор инструментов для модификации CAPF, при помощи которых, собственно, и модифицировались выше CAPF для LSP.

В силу архитектурных особенностей =Corfu= и =Corfu-doc= не умеют работать в терминальном режиме, поэтому параллельно устанавливаются пакеты [[https://codeberg.org/akib/emacs-corfu-terminal][Corfu-terminal]] и [[https://codeberg.org/akib/emacs-corfu-doc-terminal][Corfu-doc-terminal]]. Также устанавливаются необходимый пакет [[https://codeberg.org/akib/emacs-popon][Emacs-popon]] (так как последние три пакета теперь есть в NonGNU ELPA, то, возможно, что ручная установка более не требуется).

| Клавиша | Карта     | Команда        | Действие           |
|---------+-----------+----------------+--------------------|
| =TAB=     | corfu-map | corfu-next     | Следующий вариант  |
| =S-TAB=   | corfu-map | corfu-previous | Предыдущий вариант |

#+begin_src emacs-lisp
(when init/corfu
    (setup (:straight (corfu :files (:defaults "extensions/*")
                             :includes (corfu-popupinfo))
                      kind-icon)
        (:option corfu-auto nil
                 corfu-cycle t
                 corfu-preselect-first nil
                 corfu-preview-current 'insert
                 tab-always-indent 'complete
                 kind-icon-default-face 'corfu-default
                 corfu-popupinfo-delay 0.2)
        (:bind-into corfu-map
            "TAB" corfu-next
            [tab] corfu-next
            "S-TAB" corfu-previous
            [backtab] corfu-previous)
        (corfu-popupinfo-mode)
        (global-corfu-mode)
        (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
        (add-to-list 'completion-at-point-functions #'cape-file t)))
#+end_src

При желании можно использовать [[https://company-mode.github.io/][Company Mode]] в связке с [[https://github.com/sebastiencs/company-box][Company Box]] (для иконок). В целом, все аналогично приведенному выше набору пакетов, однако есть нюансы. Во-первых, =Company= использует собственный механизм бэкендов, а во-вторых, он не совместим со =Smartparens=, происходит дублирование закрывающей скобки. Насколько мне известно, это еще [[https://github.com/Fuco1/smartparens/issues/445][не исправлено]].

#+begin_src emacs-lisp
(unless init/corfu
    (setup (:straight company
                      company-box)
        (:option tab-always-indent 'complete
                 company-backends '((company-capf))
                 company-selection-wrap-around t
                 company-minimum-prefix-length 1
                 company-idle-delay nil
                 company-tooltip-align-annotations t
                 company-transformers '(delete-consecutive-dups
                                        company-sort-by-occurrence
                                        company-sort-prefer-same-case-prefix))
        (:global [remap indent-for-tab-command] company-indent-or-complete-common)
        (:with-map company-active-map
            (:bind "RET"      company-complete-selection
                   "<return>" company-complete-selection
                   "<tab>"    company-complete-common-or-cycle
                   "<escape>" company-abort))
        (:hook company-box-mode)
        (:with-hook after-init-hook
            (:hook global-company-mode))))
#+end_src

** Vertico, Consult и Embark или Ivy

Если описанные выше пакеты =Corfu= и =Company= служат для облегчения автодополнения при работе в основных буферах, то следующие предназначены для минибуфера. [[https://github.com/minad/vertico][Vertico]] является облегченным аналогом =Ivy= или =Helm=, опирающимся на встроенные в Emacs возможности.

[[https://github.com/minad/consult][Consult]] представляет собой набор функций, расширяющих встроенные в Emacs аналоги.

[[https://github.com/oantolin/embark][Embark]] позволяет выполнить некоторое стандартное действие в зависимости от того, что находится под курсором.

[[https://github.com/oantolin/orderless][Orderless]] дает возможность поиска в минибуфере при помощи ввода некоторого набора условий (например частей строк), разделенных пробелами. Будут показаны кандидаты, соответствующие всем условиям в *произвольном* порядке.

| Клавиша | Карта  | Команда         | Действие                                     |
|---------+--------+-----------------+----------------------------------------------|
| =C-x b=   | global | consult-buffer  | Меню выбора буфера                           |
| =C-x C-b= | global | ibuffer         | "Стандартное" меню выбора буфера             |
| =C-.=     | global | embark-act      | Меню выбора действия с объектом под курсором |
| =C-;=     | global | embark-dwim     | Выполнение стандартного действия с объектом  |
| =C-h B=   | global | embark-bindings | Меню со справкой по комбинациям клавиш       |
| =C-s=     | global | consult-line    | Поиск строк по шаблону                       |
| =M-R=     | global | vertico-repeat  | Повтор предыдущего поиска                    |

#+begin_src emacs-lisp
(when init/vertico
    (setup (:straight (vertico :files (:defaults "extensions/*"))
                      consult
                      embark
                      orderless)
        (add-to-list 'process-coding-system-alist
                     '("[rR][gG]" . (utf-8-dos . windows-1251-dos)))
        (:option vertico-cycle t
                 vertico-mouse-mode t
                 vertico-count 8
                 vertico-resize t
                 prefix-help-command #'embark-prefix-help-command
                 completion-styles '(orderless basic)
                 completion-category-defaults nil
                 completion-category-overrides '((file (styles basic partial-completion)))
                 affe-regexp-compiler #'affe-orderless-regexp-compiler)
        (:global "C-x b" consult-buffer
                 "C-x C-b" ibuffer
                 "C-." embark-act
                 "C-;" embark-dwim
                 "C-h B" embark-bindings
                 "C-s" consult-line
                 "C-S-s" consult-ripgrep
                 "M-R" vertico-repeat)
        (:with-hook minibuffer-setup-hook
            (:hook (lambda ()
                       (setq completion-in-region-function
                             (if vertico-mode
                                     #'consult-completion-in-region
                                 #'completion--in-region)))
                   vertico-repeat-save))
        (vertico-mode)
        (:with-mode embark-collect-mode
            (:hook consult-preview-at-point-mode))))
#+end_src

[[https://github.com/abo-abo/swiper][Ivy]] является инструментом, альтернативным =Vertico=.

| Клавиша | Карта  | Команда                    | Действие                                |
|---------+--------+----------------------------+-----------------------------------------|
| =C-s=     | global | swiper-isearch             | Поиск строк по шаблону                  |
| =M-x=     | global | counsel-M-x                | Меню интерактивных команд               |
| =C-x C-f= | global | counsel-find-file          | Меню открытия файлов                    |
| =M-y=     | global | counsel-yank-pop           | Меню kill-ring                          |
| =<f1> l=  | global | counsel-find-library       | Переход к исходному коду библиотеки     |
| =<f2> i=  | global | counsel-info-lookup-symbol | Поиск справки для символа               |
| =<f2> u=  | global | counsel-unicode-char       | Поиск символа Юникод                    |
| =<f2> j=  | global | counsel-set-variable       | Изменение значения переменной           |
| =C-x b=   | global | ivy-switch-buffer          | Переключение буферов при помощи =Ivy=     |
| =C-x C-b= | global | ibuffer                    | Переключение буферов при помощи =ibuffer= |
| =C-c v=   | global | ivy-push-view              |                                         |
| =C-c V=   | global | ivy-pop-view               |                                         |
| =M-R=     | global | ivy-resume                 | Повтор предыдущего поиска               |

#+begin_src emacs-lisp
(unless init/vertico
    (setup (:straight ivy
                      ivy-rich
                      nerd-icons-ivy-rich
                      swiper
                      counsel
                      smex)
        (:option ivy-use-virtual-buffers t
                 ivy-count-format "(%d/%d) "
                 ivy-wrap t)
        (:global "C-s" swiper-isearch
                 "M-x" counsel-M-x
                 "C-x C-f" counsel-find-file
                 "M-y" counsel-yank-pop
                 "<f1> l" counsel-find-library
                 "<f2> i" counsel-info-lookup-symbol
                 "<f2> u" counsel-unicode-char
                 "<f2> j" counsel-set-variable
                 "C-x b" ivy-switch-buffer
                 "C-x C-b" ibuffer
                 "C-c v" ivy-push-view
                 "C-c V" ivy-pop-view
                 "M-R" ivy-resume)
        (ivy-mode t)

        (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
        (ivy-rich-mode 1)

        (nerd-icons-ivy-rich-mode 1)))
#+end_src

** Сниппеты

На текущий момент многие воспринимают как стандарт [[https://github.com/joaotavora/yasnippet][Yasnippet]] (а точнее формат шаблонов [[http://manual.macromates.com/en/snippets][TextMate]]): ряд LSP возвращают сниппеты в совместимом с Yasnippet формате, что позволяет ему подхватывать их `на лету`.

[[https://github.com/AndreaCrotti/yasnippet-snippets][Yasnippet-snippets]] добавляет коллекцию сниппетов для большого числа разных языков программирования. [[https://github.com/mohkale/consult-yasnippet][Consut-Yasnippet]] включает поддержку =Yasnippet= в =Consult=.

| Клавиша | Карта  | Команда           | Действие      |
|---------+--------+-------------------+---------------|
| =<f7>=  | global | consult-yasnippet | Меню шаблонов |

#+begin_src emacs-lisp
(setup (:straight yasnippet
                  yasnippet-snippets
                  consult-yasnippet)
    (:option yas-snippet-dirs (append yas-snippet-dirs
                                      '("~/.emacs.d/snippets")))
    (:bind-into yas-minor-mode-map
        "<tab>" nil
        "TAB" nil)
    (yas-global-mode 1)

    (:global "<f7>" consult-yasnippet))
#+end_src

