init.el
                             :includes (corfu-popupinfo))
                      kind-icon)
        (:option corfu-auto nil
                 corfu-cycle t
                 corfu-preselect-first nil
                 corfu-preview-current 'insert
                 tab-always-indent 'complete
                 kind-icon-default-face 'corfu-default
                 corfu-popupinfo-delay 0.2)
        (:bind-into corfu-map
            "TAB" corfu-next
            [tab] corfu-next
            "S-TAB" corfu-previous
            [backtab] corfu-previous)
        (corfu-popupinfo-mode)
        (global-corfu-mode)
        (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
        (add-to-list 'completion-at-point-functions #'cape-file t)))

(unless init/corfu
    (setup (:straight company
                      company-box)
        (:option tab-always-indent 'complete
                 company-backends '((company-capf))
                 company-selection-wrap-around t
                 company-minimum-prefix-length 1
                 company-idle-delay nil
                 company-tooltip-align-annotations t
                 company-transformers '(delete-consecutive-dups
                                        company-sort-by-occurrence
                                        company-sort-prefer-same-case-prefix))
        (:global [remap indent-for-tab-command] company-indent-or-complete-common)
        (:with-map company-active-map
            (:bind "RET"      company-complete-selection
                   "<return>" company-complete-selection
                   "<tab>"    company-complete-common-or-cycle
                   "<escape>" company-abort))
        (:hook company-box-mode)
        (:with-hook after-init-hook
            (:hook global-company-mode))))

(when init/vertico
    (setup (:straight (vertico :files (:defaults "extensions/*"))
                      consult
                      embark
                      orderless)
        (add-to-list 'process-coding-system-alist
                     '("[rR][gG]" . (utf-8-dos . windows-1251-dos)))
        (:option vertico-cycle t
                 vertico-mouse-mode t
                 vertico-count 8
                 vertico-resize t
                 prefix-help-command #'embark-prefix-help-command
                 completion-styles '(orderless basic)
                 completion-category-defaults nil
                 completion-category-overrides '((file (styles basic partial-completion)))
                 affe-regexp-compiler #'affe-orderless-regexp-compiler)
        (:global "C-x b" consult-buffer
                 "C-x C-b" ibuffer
                 "C-." embark-act
                 "C-;" embark-dwim
                 "C-h B" embark-bindings
                 "C-s" consult-line
                 "C-S-s" consult-ripgrep
                 "M-R" vertico-repeat)
        (:with-hook minibuffer-setup-hook
            (:hook (lambda ()
                       (setq completion-in-region-function
                             (if vertico-mode
                                     #'consult-completion-in-region
                                 #'completion--in-region)))
                   vertico-repeat-save))
        (vertico-mode)
        (:with-mode embark-collect-mode
            (:hook consult-preview-at-point-mode))))

(unless init/vertico
    (setup (:straight ivy
                      ivy-rich
                      nerd-icons-ivy-rich
                      swiper
                      counsel
                      smex)
        (:option ivy-use-virtual-buffers t
                 ivy-count-format "(%d/%d) "
                 ivy-wrap t)
        (:global "C-s" swiper-isearch
                 "M-x" counsel-M-x
                 "C-x C-f" counsel-find-file
                 "M-y" counsel-yank-pop
                 "<f1> l" counsel-find-library
                 "<f2> i" counsel-info-lookup-symbol
                 "<f2> u" counsel-unicode-char
                 "<f2> j" counsel-set-variable
                 "C-x b" ivy-switch-buffer
                 "C-x C-b" ibuffer
                 "C-c v" ivy-push-view
                 "C-c V" ivy-pop-view
                 "M-R" ivy-resume)
        (ivy-mode t)

        (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
        (ivy-rich-mode 1)

        (nerd-icons-ivy-rich-mode 1)))

(setup (:straight yasnippet
                  yasnippet-snippets
                  consult-yasnippet)
    (:option yas-snippet-dirs (append yas-snippet-dirs
                                      '("~/.emacs.d/snippets")))
    (:bind-into yas-minor-mode-map
        "<tab>" nil
        "TAB" nil)
    (yas-global-mode 1)

    (:global "<f7>" consult-yasnippet))
