init.org
* Настройки для языков программирования

[[https://github.com/bbatsov/projectile][Projectile]] --- пакет для удобного управления проектами, дающий возможность поиска и замены по проекту и т. д.

| Клавиша | Карта  | Команда                | Действие                                 |
|---------+--------+------------------------+------------------------------------------|
| =C-c p=   | global | projectile-command-map | Префикс для комбинаций клавиш Projectile |

#+begin_src emacs-lisp
(setup (:straight projectile)
    (:option projectile-completion-system 'default)
    (:bind "C-c p" projectile-command-map)
    (projectile-mode t))
#+end_src

[[https://github.com/flycheck/flycheck][Flycheck]] служит для провеки синтаксиса "на лету".

#+begin_src emacs-lisp
(setup (:straight flycheck)
    (global-flycheck-mode))
#+end_src

Magit --- пакет для работы с git внутри Emacs.

#+begin_src emacs-lisp
(setup (:straight magit)
    (:require magit))
#+end_src

Переназначение главных режимов для языков программирования для использования =Tree-Sitter=, работает только в Emacs 29 и новее.

#+begin_src emacs-lisp
(when (>= emacs-major-version 29)
    (setq major-mode-remap-alist
          '((python-mode . python-ts-mode))))
#+end_src

** Markdown

#+begin_src emacs-lisp
(setup (:straight markdown-mode)
    (:with-mode gfm-mode
        (:file-match "README\\.md\\'"))
    (:with-mode markdown-mode
        (:file-match "\\.md\\'"
                     "\\.markdown\\'"))
    (:option markdown-fontify-code-blocks-natively t
             markdown-command "multimarkdown"))
#+end_src

** Org-mode

Данная настройка отключает проверку соответствия для угловых скобок в org-файлах.

#+begin_src emacs-lisp
(defun my/angle-brackets-fix ()
    (modify-syntax-entry ?< "." org-mode-syntax-table)
    (modify-syntax-entry ?> "." org-mode-syntax-table))
#+end_src

[[https://github.com/sabof/org-bullets][Org-bullets]] позволяет настроить метки при разделах org-документа. [[https://github.org/snosov1/toc-org][TOC-org]] дает возможность более гибкой настройки оглавления. [[https://github.com/awth13/org-appear][org-appear]] сворачивает форматирование в org-документах, разворачивая при наведении курсора. [[https://github.com/Fanael/edit-indirect][Edit-indirect]] дает возможность редактирования блоков с исходным кодом в отдельных буферах.

#+begin_src emacs-lisp
  (setup org
      (:straight edit-indirect
                 org-bullets
                 toc-org
                 org-appear
                 org-auto-tangle)
      (:option org-edit-src-content-indentation 0
               org-src-preserve-indentation nil
               org-src-fontify-natively t
               org-src-tab-acts-natively t
               org-return-follows-link t
               org-mouse-1-follows-link t
               org-descriptive-links t
               org-hide-emphasis-markers t
               org-support-shift-select t
               org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")
               org-appear-autolinks t
               org-appear-autosubmarkers t)
      (require 'org-tempo)
      (org-babel-do-load-languages
       'org-babel-load-languages '((emacs-lisp . t)
                                   (python . t)
                                   (lua . t)
                                   (haskell . t)
                                   (shell . t)))
      (progn
          (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
          (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
          (add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
          (add-to-list 'org-structure-template-alist '("lua" . "src lua"))
          (add-to-list 'org-structure-template-alist '("py" . "src python"))
          (add-to-list 'org-structure-template-alist '("tex" . "src tex")))
      (:hook org-indent-mode
             my/angle-brackets-fix
             org-bullets-mode
             toc-org-mode
             org-appear-mode
             org-auto-tangle-mode))
#+end_src

** ESS

#+begin_src emacs-lisp
(setup (:straight ess)
    (:option polymode-lsp-integration nil)
    (setq display-buffer-alist
          (append `(("^\\*R Dired"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . -1)
                     (window-width . 0.33)
                     (reusable-frames . nil))
                    ("^\\*R view"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . 1)
                     (window-width . 0.33)
                     (reusable-frames . nil))
                    ("^\\*R"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . 1)
                     (window-width . 0.33)
                     (reusable-frames . nil)))
                  display-buffer-alist))
    (:with-mode ess-r-mode
        (setq-local fill-column 80)
        (:file-match "\\.R$")
        (:hook lsp/lsp
               (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))
        (:with-hook ess-r-post-run-hook
            (:hook ess-rdired)))
    (:with-mode ess-stata-mode
        (:file-match "\\.do$")
        (:hook (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))))
#+end_src

** Python

Настроим стандартный интерпретатор Python для Emacs.

#+begin_src emacs-lisp
(setq python-python-command "python")
#+end_src

Функция для модификации списка CAPF при открытии Python-файлов.

#+begin_src emacs-lisp
(defun capf/python-mode ()
    "Extra CAPF for `python-mode'."
    (setq completion-at-point-functions
          (append completion-at-point-functions
                  (list 'cape-file))))

(defalias 'capf/python-ts-mode 'capf/python-mode)
#+end_src

#+begin_src emacs-lisp
(setup python
    (:straight lsp-pyright)
    (:option python-shell-interpreter "python"
             eglot-ignored-server-capabilites '(:documentHighlightProvider :hoverProvider))
    (:hook lsp/lsp
           (lambda ()
               (setq-local fill-column 80)
               (display-fill-column-indicator-mode)))
    (:with-mode python-ts-mode
        (:hook lsp/lsp
               (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))))
#+end_src

** JS

Для начала надо установить =typescript= и =typescript-language-server= через =npm=.

#+begin_src shell :tangle no
npm i -g typescript-language-server; npm i -g typescript
#+end_src

#+begin_src emacs-lisp
(setup js
    (:file-match "\\.js.R$")
    (:hook lsp/lsp))
#+end_src

** Lua

#+begin_src emacs-lisp
(setup (:straight lua-mode)
    (:file-match "\\.lua$")
    (:option lua-indent-level 4))
#+end_src

