init.el

(setup (:straight projectile)
    (:option projectile-completion-system 'default)
    (:bind "C-c p" projectile-command-map)
    (projectile-mode t))

(setup (:straight flycheck)
    (global-flycheck-mode))

(setup (:straight magit)
    (:require magit))

(when (>= emacs-major-version 29)
    (setq major-mode-remap-alist
          '((python-mode . python-ts-mode))))

(setup (:straight markdown-mode)
    (:with-mode gfm-mode
        (:file-match "README\\.md\\'"))
    (:with-mode markdown-mode
        (:file-match "\\.md\\'"
                     "\\.markdown\\'"))
    (:option markdown-fontify-code-blocks-natively t
             markdown-command "multimarkdown"))

(defun my/angle-brackets-fix ()
    (modify-syntax-entry ?< "." org-mode-syntax-table)
    (modify-syntax-entry ?> "." org-mode-syntax-table))

(setup org
    (:straight edit-indirect
               org-bullets
               toc-org
               org-appear
               org-auto-tangle)
    (:option org-edit-src-content-indentation 0
             org-src-preserve-indentation nil
             org-src-fontify-natively t
             org-src-tab-acts-natively t
             org-return-follows-link t
             org-mouse-1-follows-link t
             org-descriptive-links t
             org-hide-emphasis-markers t
             org-support-shift-select t
             org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")
             org-appear-autolinks t
             org-appear-autosubmarkers t)
    (require 'org-tempo)
    (org-babel-do-load-languages
     'org-babel-load-languages '((emacs-lisp . t)
                                 (python . t)
                                 (lua . t)
                                 (haskell . t)
                                 (shell . t)))
    (progn
        (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
        (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
        (add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
        (add-to-list 'org-structure-template-alist '("lua" . "src lua"))
        (add-to-list 'org-structure-template-alist '("py" . "src python"))
        (add-to-list 'org-structure-template-alist '("tex" . "src tex")))
    (:hook org-indent-mode
           my/angle-brackets-fix
           org-bullets-mode
           toc-org-mode
           org-appear-mode
           org-auto-tangle-mode))

(setup (:straight ess)
    (:option polymode-lsp-integration nil)
    (setq display-buffer-alist
          (append `(("^\\*R Dired"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . -1)
                     (window-width . 0.33)
                     (reusable-frames . nil))
                    ("^\\*R view"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . 1)
                     (window-width . 0.33)
                     (reusable-frames . nil))
                    ("^\\*R"
                     (display-buffer-reuse-window display-buffer-in-side-window)
                     (side . right)
                     (slot . 1)
                     (window-width . 0.33)
                     (reusable-frames . nil)))
                  display-buffer-alist))
    (:with-mode ess-r-mode
        (setq-local fill-column 80)
        (:file-match "\\.R$")
        (:hook lsp/lsp
               (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))
        (:with-hook ess-r-post-run-hook
            (:hook ess-rdired)))
    (:with-mode ess-stata-mode
        (:file-match "\\.do$")
        (:hook (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))))

(setq python-python-command "python")

(defun capf/python-mode ()
    "Extra CAPF for `python-mode'."
    (setq completion-at-point-functions
          (append completion-at-point-functions
                  (list 'cape-file))))

(defalias 'capf/python-ts-mode 'capf/python-mode)

(setup python
    (:straight lsp-pyright)
    (:option python-shell-interpreter "python"
             eglot-ignored-server-capabilites '(:documentHighlightProvider :hoverProvider))
    (:hook lsp/lsp
           (lambda ()
               (setq-local fill-column 80)
               (display-fill-column-indicator-mode)))
    (:with-mode python-ts-mode
        (:hook lsp/lsp
               (lambda ()
                   (setq-local fill-column 80)
                   (display-fill-column-indicator-mode)))))

(setup js
    (:file-match "\\.js.R$")
    (:hook lsp/lsp))

(setup (:straight lua-mode)
    (:file-match "\\.lua$")
    (:option lua-indent-level 4))
